In [1]:
%load_ext sql
# Create database
!python create_tables.py
!python etl.py

Welcome to Sparkify DB ELT.
This program will create and populate a set of tables required for Sparkify's operations
Inserting song...
Checking data in  songs  table...
Check sucessful.Total number of records in  songs  table:  1
Inserting artist...
Checking data in  artists  table...
Check sucessful.Total number of records in  artists  table:  1
Inserting time...
Checking data in  time  table...
Check sucessful.Total number of records in  time  table:  1
Inserting user...
Checking data in  users  table...
Check sucessful.Total number of records in  users  table:  1
Inserting songplays...
Checking data in  songplays  table...
Check sucessful.Total number of records in  songplays  table:  1
ETL Operation complete.

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('1543279932796', 88, 'paid', 'Horn Concerto No. 4 in E flat K495: II. Romance (Andante cantabile)', 'Barry Tuckwell/Academy of St Martin-in-the-Fields/Sir Neville Marriner', '961', 'Sacramento--Roseville--Arden-Arcade, CA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"')]

In [3]:

%sql SELECT * FROM users LIMIT 10;

 * postgresql://student:***@127.0.0.1/sparkifydb
10 rows affected.

[(38, 'Gianna', 'Jones', 'F', 'free'),
 (8, 'Kaylee', 'Summers', 'F', 'free'),
 (66, 'Kevin', 'Arellano', 'M', 'free'),
 (69, 'Anabelle', 'Simpson', 'F', 'free'),
 (52, 'Theodore', 'Smith', 'M', 'free'),
 (80, 'Tegan', 'Levine', 'F', 'paid'),
 (5, 'Elijah', 'Davis', 'M', 'free'),
 (16, 'Rylan', 'George', 'M', 'paid'),
 (24, 'Layla', 'Griffin', 'F', 'paid'),
 (86, 'Aiden', 'Hess', 'M', 'free')]

In [4]:

%sql SELECT * FROM songs LIMIT 10;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('SOGDBUF12A8C140FAA', 'AR558FS1187FB45658', 'Intro', 2003, Decimal('75.67628'))]

In [5]:

%sql SELECT * FROM artists;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('AR558FS1187FB45658', '40 Grit', '', 'NaN', 'NaN')]

In [6]:

%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 27, 0, 52, 12, 796000), 0, 27, 48, 11, 2018, 1),
 (datetime.datetime(2018, 11, 27, 0, 56, 49, 796000), 0, 27, 48, 11, 2018, 1),
 (datetime.datetime(2018, 11, 27, 1, 0, 48, 796000), 1, 27, 48, 11, 2018, 1),
 (datetime.datetime(2018, 11, 27, 1, 33, 16, 796000), 1, 27, 48, 11, 2018, 1),
 (datetime.datetime(2018, 11, 27, 1, 38, 37, 796000), 1, 27, 48, 11, 2018, 1)]